In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
s = pd.Series([1,3,5, np.nan, 6,8 ])

In [6]:
dates = pd.date_range('20130101', periods = 6)
dates
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.112959 -0.426658  1.336946  1.586535
2013-01-02  0.085895  0.982035  0.657900  0.376439
2013-01-03 -0.302095 -1.393957  0.711975 -0.453794
2013-01-04 -1.004823  1.148880 -0.314322  0.404630
2013-01-05 -0.280600 -0.165989 -0.187675 -0.652289
2013-01-06 -0.827708 -1.333869  0.864992 -0.294121

In [9]:
df2 = pd.DataFrame({'A':1,
                   'B':pd.Timestamp('20130102'),
                   'C':pd.Series(1, index = list(range(4)), dtype = 'float32'),
                   'D':np.array([3]*4, dtype = 'int32'),
                   'E':pd.Categorical(["test","train","test","train"]),
                   'F':'foo'})

df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [17]:
# selection by labels
df.loc[:, ['A','B']]

                   A         B
2013-01-01 -1.112959 -0.426658
2013-01-02  0.085895  0.982035
2013-01-03 -0.302095 -1.393957
2013-01-04 -1.004823  1.148880
2013-01-05 -0.280600 -0.165989
2013-01-06 -0.827708 -1.333869

In [18]:
# selection by position
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.004823  1.148880
2013-01-05 -0.280600 -0.165989

In [19]:
#In Pandas, indexing a DataFrame returns a reference to the initial DataFrame. Thus, changing the subset will change the initial DataFrame. Thus, you'd want to use the copy if you want to make sure the initial DataFrame shouldn't change.

df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.302095 -1.393957  0.711975 -0.453794   two
2013-01-05 -0.280600 -0.165989 -0.187675 -0.652289  four

In [20]:
left = pd.DataFrame({'key':['foo','bar'], 'lval': [1,2]})
right = pd.DataFrame({'key':['foo','bar'], 'rval': [4,5]})
pd.merge(left, right, on = 'key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [21]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                      'foo', 'foo', 'qux', 'qux'],
                      ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))

In [22]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]